mobile/src/InformationRegisters/Спецификации/Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спецификации</name>
  <attributes>
    <name>specification_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>stage_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>index</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>qnt</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>specification_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>stage_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

mobile/src/InformationRegisters/Спецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСпецификации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спецификации.specification_id КАК Идентификатор,
		|	Спецификации.specification_name КАК Наименование
		|ИЗ
		|	РегистрСведений.Спецификации КАК Спецификации";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	ТаблицаЗначений.Индексы.Добавить("Идентификатор");	
	
	Возврат ТаблицаЗначений;	
КонецФункции

Функция ПолучитьВидыСтадийОбработки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спецификации.stage_id КАК Идентификатор,
		|	Спецификации.stage_name КАК Наименование
		|ИЗ
		|	РегистрСведений.Спецификации КАК Спецификации";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	ТаблицаЗначений.Индексы.Добавить("Идентификатор");	
	
	Возврат ТаблицаЗначений;	
КонецФункции

Функция ПолучитьВидыСтадийОбработкиСпецификации(ИдентификаторСпецификации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спецификации.stage_id КАК Идентификатор,
		|	Спецификации.stage_name КАК Наименование,
		|	Спецификации.index КАК НомерСтроки,
		|	Спецификации.qnt КАК Количество
		|ИЗ
		|	РегистрСведений.Спецификации КАК Спецификации
		|ГДЕ
		|	Спецификации.specification_id = &id
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Запрос.УстановитьПараметр("id", ИдентификаторСпецификации);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();	
	
	Возврат ТаблицаЗначений;	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Попытка
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
		МенеджерЗаписи.Записать();		
	Исключение
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
